"""
На вход программе подается два натуральных числа a и b (a < b).
Напишите программу, которая находит натуральное число из отрезка [a; b] с максимальной суммой делителей.

Формат входных данных
На вход программе подаются два числа, каждое на отдельной строке.

Формат выходных данных
Программа должна вывести два числа на одной строке, разделенных пробелом: число с максимальной суммой делителей и сумму его делителей.

Примечание. Если таких чисел несколько, то выведите наибольшее из них.


Sample Input 1:
1
10

Sample Output 1:
10 18

Sample Input 2:
1
100

Sample Output 2:
96 252
"""
