"""
Напишите программу, которая выводит прямоугольник, по периметру состоящий из звездочек (*).

Примечание. Высота и ширина прямоугольника равны 444 и 171717 звёздочкам соответственно.
Тестовые данные 🟢

Sample Input:

Sample Output:

*****************
*               *
*               *
*****************


"""


print(17*'*')
print('*','*',sep=' '*15)
print('*','*',sep=' '*15)
print(17*'*')
