"""
Даны три вещественных числа a, b, c. Напишите программу,
которая находит вещественные корни квадратного уравнения
ax**2+bx+c=0.

Формат входных данных
На вход программе подается три вещественных числа a≠0, b, c, каждое на отдельной строке.

Формат выходных данных
Программа должна вывести вещественные корни уравнения если они существуют или текст «Нет корней» в противном случае.

Примечание. Если уравнение имеет два корня, то следует вывести их в порядке возрастания.

"""
from  math import *
n, a = float(input()), float(input())
s=(n*a**2)/(4*tan(pi/n))
print(s)
