"""
На вход программе подается натуральное число nnn. Напишите программу, которая вычисляет n!.

Входные данные
На вход программе подается натуральное число n, (n≤12).

Выходные данные
Программа должна вывести единственное число в соответствии с условием задачи.

Примечание. Факториалом натурального числа nnn, называется произведение всех натуральных чисел от 1 до n, то есть
n!=1⋅2⋅3⋅…⋅n

"""


total = 0
for i in range(10):
    n = int(input())
    if n != 0
        total = total + i
print(total)
