"""
В купейном вагоне имеется 999 купе с четырьмя местами для пассажиров в каждом.
Напишите программу, которая определяет номер купе, в котором находится место с заданным номером
https://stepik.org/lesson/284816/step/10?unit=266160
"""
n = int(input())
print(-(-n//4))
